[
 {
   "Sequence": 1,
   "Title": "Birth",
   "Place": "Bethlehem",
   "Longitude": 35.1956,
   "Latitude": 31.7031,
   "Date": "BC 4",
   "Jesus' Age": 0,
   "Description": "Jesus was born around 4 BC after Mary was told that she was to give birth by the Angel Gaberial. Mary was engaged to Joseph who is from the family of Judah and David. Mary then became pregnant by the Holy Spirit though this not the same as mythological gods impregnanting humans. This was required as it seems that the sinful nature was passed down through the father. This allowed Jesus to be fully human but not born into sin.* ",
   "Biblical References": "Luke 1:26-38; \nMatthew 1:18-25",
   "Got Questions": "https://www.gotquestions.org/virgin-birth.html",
   "Notes": "",
   "Description Word Count": 80,
   "Indigitube": {"movie_name": "The Savior – 1. Jesus’ Birth – Pashto Language Film", "movie_link": "https://www.thesavior.info/ps/the-savior/jesus-birth"},
   "Bible Project": "https://www.youtube.com/watch?v=_OLezoUvOEQ&list=PLH0Szn1yYNec6O3ZOZzAMb2WW2abJwzZ-",
   "The Chosen": ""
 },
 {
   "Sequence": 2,
   "Title": "Wiseman Visit",
   "Place": "Bethlehem",
   "Longitude": 35.1956,
   "Latitude": 31.7031,
   "Date": "BC 2",
   "Jesus' Age": 2,
   "Description": "Magi are wise men who travelled to Bethlem from the East. They likely arrived when Jesus was 2 years old. They were also likely from Persia, which is modern day Iran. They likely knew about this star to come because of the prophet Daniel in Daniel 9:24-27. There was also the prophecy of Balaam in Numbers 24:17 that mentions a star coming out of Jacob, also known as Isreal. Also, nothing stats that there were three wisemen but just three gifts.",
   "Biblical References": "Matthew 2:1-11",
   "Got Questions": "https://www.gotquestions.org/three-wise-men.html",
   "Notes": "",
   "Description Word Count": 81,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=xhD8lG9VDVc",
   "The Chosen": ""
 },
 {
   "Sequence": 3,
   "Title": "Angel Tells Family to Flee",
   "Place": "Somewhere near Heliopolis, Egypt",
   "Longitude": 31.2343,
   "Latitude": 30.007,
   "Date": "BC 2",
   "Jesus' Age": 2,
   "Description": "After the wisemen left an angel appeared to Joseph in a dream, warning them to flee for Egypt. Funny enough when Jesus returns from Egypt with his family because Herod is now dead He fulfilled the Messianic prophecy in Hosea 11:1 that Jesus will come out of Egypt. So Herod''s selfish and scared attempt to kill Jesus, a new king, was used by God. Throughout Jesus' life it parrells what that nation of Isreal has gone through after God leads them out of Egypt under the leadership of Moses. ",
   "Biblical References": "Matthew 2:12-23",
   "Got Questions": "https://www.gotquestions.org/Hosea-11-1-Messianic.html",
   "Notes": "Visual a path to Egypt?",
   "Description Word Count": 89,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=ISmDaZgC_mk",
   "The Chosen": ""
 },
 {
   "Sequence": 4,
   "Title": "Jesus Age 12 in the Temple",
   "Place": "Jerusalem",
   "Longitude": 35.2167,
   "Latitude": 31.7833,
   "Date": "",
   "Jesus' Age": 12,
   "Description": "Just like all Jewish familys Jesus and his parents went to Jerusalem to take part of the Passover Feast. The passover is an event that happened when the Jews were slaves in Egypt and the final miracle performed by God. On the way back, Joseph and Mary left Jesus in Jerusalem without knowing. In shock, they turned back and spent three days looking for Jesus. On the third day they found Jesus teaching in the temple and they were in distraught. People listening to Jesus were astonished about what this 12 year old understood and his answers. Jesus' parents questioned why he was at the temple. Jesus respond sincerly and amazed, \"Why were you looking for me? Did you now know that I must be in my Father's house?\" But he was obedient to His parents and went with them back to Nazareth",
   "Biblical References": "Luke 2:41-52",
   "Got Questions": "https://www.gotquestions.org/Jesus-childhood.html",
   "Notes": "The angel of death killed of each first born male from humans and animals unless the blood of a perfect lamb was spread over the door posts of a home. If that was so, the angel passed over that home.",
   "Description Word Count": 143,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=jJJo0Fksivk",
   "The Chosen": ""
 },
 {
   "Sequence": 5,
   "Title": "Jesus growing up at home",
   "Place": "Nazareth",
   "Longitude": 35.3033,
   "Latitude": 32.7019,
   "Date": "",
   "Jesus' Age": null,
   "Description": "During the rest of Jesus childhood he grew up. The Bible says, \"Jesus grew in wisdom and in stature and in favor with God and all the people\" (Luke 2:52).",
   "Biblical References": "Luke 2:52",
   "Got Questions": "https://www.gotquestions.org/Bible-family.html",
   "Notes": "",
   "Description Word Count": 30,
   "Indigitube": "",
   "Bible Project": "",
   "The Chosen": ""
 },
 {
   "Sequence": 6,
   "Title": "Baptism",
   "Place": "Jordan River",
   "Longitude": 35.6192,
   "Latitude": 33.1867,
   "Date": "",
   "Jesus' Age": 30,
   "Description": "Jesus' humility came through by his choosing to be baptized. Baptism, which involved being washed with water, was a way that people showed that they were set apart to serve God, and Jesus wanted to show that as well. After doing so, the Bible says a dove came out of heaven and the voice of God spoke, saying \"This is my beloved Son, in whom I am well pleased.\" It was the beginning of a new era for Jesus. ",
   "Biblical References": "Luke 3:21-22",
   "Got Questions": "https://www.gotquestions.org/Jesus-baptized.html",
   "Notes": "",
   "Description Word Count": 79,
   "Indigitube": {"movie_name": "The Savior – 2. Jesus’ Baptism – Pashto Language Film", "movie_link": "https://www.thesavior.info/ps/the-savior/jesus-baptism"},
   "Bible Project": "https://www.youtube.com/watch?v=0k4GbvZUPuo&list=PLH0Szn1yYNec6O3ZOZzAMb2WW2abJwzZ-&index=2",
   "The Chosen": ""
 },
 {
   "Sequence": 7,
   "Title": "Temptation",
   "Place": "Wilderness",
   "Longitude": 35.3456,
   "Latitude": 31.7587,
   "Date": "",
   "Jesus' Age": 30,
   "Description": "After being baptized in the Jordan River, Jesus travelled into the wilderness where he fasted from food for 40 days. He also experienced great temptations to not trust God but instead seize power for himself. These are temptations every person faces. We are afraid to trust that God has our best interests at heart, even after we experience clear expressions of his love! Jesus experienced those temptations too, but he ultimated continued to trust God for all he needed. ",
   "Biblical References": "Luke 4:1-13",
   "Got Questions": "https://www.gotquestions.org/Jesus-temptations.html",
   "Notes": "",
   "Description Word Count": 79,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=oHy83v8pGeU",
   "The Chosen": ""
 },
 {
   "Sequence": 8,
   "Title": "First Miracle: Water to Wine",
   "Place": "Cana",
   "Longitude": 35.2992,
   "Latitude": 33.2092,
   "Date": "",
   "Jesus' Age": 30,
   "Description": "One day, Jesus attended a wedding. While he was there, the host ran out of wine! It seemed to everyone like the party was over. But then Jesus' mother, Mary, rounded up the servants and told them to listen to Jesus. Jesus tried to get off the hook, but his mom wasn't having it! Finally he agreed. The servants brought big jars, filled with gallons and gallons of water. Then Jesus told them to draw out the water, into glasses and take it to the host. When he tasted it, it was wine! The party was back on!",
   "Biblical References": "John 2:1-12",
   "Got Questions": "https://www.gotquestions.org/wedding-at-Cana.html",
   "Notes": "",
   "Description Word Count": 98,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=xaWI4-n0z_0",
   "The Chosen": "https://watch.angelstudios.com/thechosen/watch?vid=S1:E5"
 },
 {
   "Sequence": 9,
   "Title": "Cleansing of the temple",
   "Place": "Jerusalem Temple",
   "Longitude": 35.2354,
   "Latitude": 31.778,
   "Date": "",
   "Jesus' Age": 30,
   "Description": "You may have heard that the Bible says, \"When you are angry, don't sin.\" But that doesn't mean, \"Never get angry\"! In fact, Jesus famously got angry at some people outside the holy Temple. People were setting up business outside the Temple and turning religion into a for-profit enterprise! Jesus wasn't having it. He made a whip and started driving the people out of the Temple. He every started flipping over their tables! Anger can be the right response under the right circumstances. Jesus wasn't angry because he had been personally insulted, but because people were disrespecting God. Things were turned upside down, from how they should be. Perhaps, by flipping over tables, Jesus was turning things right-side up!",
   "Biblical References": "John 2:13-22",
   "Got Questions": "Who was Matthew in the Bible? | GotQuestions.org",
   "Notes": "",
   "Description Word Count": 119,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=z8z_Noilw1E",
   "The Chosen": ""
 },
 {
   "Sequence": 10,
   "Title": "Visit from Nicodemus",
   "Place": "Jerusalem",
   "Longitude": 35.2167,
   "Latitude": 31.7833,
   "Date": "",
   "Jesus' Age": 30,
   "Description": "In Jesus' day, religious leaders were among the most educated men (and they were almost all men!) of their day. Jesus was a controversial figure in their circles, so they often sparred with him in public, to try and get the best of him. But an expert named Nicodemus came late one night to have a real conversation with Jesus, out of the public eye. He wasn't doing it to be an \"influencer,\" but out of true curiosity. He asked honest questions. At one point, Jesus seemed surprised, \"You're an expert!\" he exclaimed, \"and yet you don't understand these things?\" It seems Nicodemus's expertise has missed some of the most important things!",
   "Biblical References": "John 2:23-3:21",
   "Got Questions": "https://www.gotquestions.org/Nicodemus-in-the-Bible.html",
   "Notes": "",
   "Description Word Count": 112,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=EjIlhu-yuTI",
   "The Chosen": "https://watch.angelstudios.com/thechosen/watch?vid=S1:E7"
 },
 {
   "Sequence": 11,
   "Title": "Chooses the Four Disciples",
   "Place": "Sea of Galilee",
   "Longitude": 35.5833,
   "Latitude": 32.8333,
   "Date": "",
   "Jesus' Age": 31,
   "Description": "One day, Jesus was preaching on the shore and many people were interested in what He shared clearly about God's Word. Eventually, He was pushed to the edge of the shore and asked Simon Peter, who was cleaning his net, if He could use His boat to sit in it just a little off shore. Peter agreed. After Jesus was done sharing Jesus asked Peter to out deeper and drop your nets to catch some fist. Peter was tired and said they were fishing all night and they didn't catch anything! Peter agreed to try it anyways. Oh boy, was Peter surpised when he did that! The net had some many fish it started to tear and the boat started to sink with all that weight! Peter called over for help from the other fishermen, Andrew and the sons of Zebedee, James and John. After Peter had time to think he realized what happened and knew that Jesus was the Lord and told Jesus to leave him because he knew how sinful he was. Jesus didn't let Peter to tremble in fear by reassuring him to not be afraid. Jesus then called the 4 men to follow Him since they will now be fishermen of people.",
   "Biblical References": "Luke 5:1-11 ;\nMatthew 4:18-22",
   "Got Questions": "https://www.gotquestions.org/order-calling-Jesus-disciples.html",
   "Notes": "",
   "Description Word Count": 206,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=0eODunc52EQ",
   "The Chosen": "https://watch.angelstudios.com/thechosen/watch?vid=S1:E4"
 },
 {
   "Sequence": 12,
   "Title": "Sermon on the Mount",
   "Place": "Near Capernaum",
   "Longitude": 35.575,
   "Latitude": 32.8811,
   "Date": "",
   "Jesus' Age": 31,
   "Description": "Shortly after Jesus' ministry started this first sermon Jesus shares with His disciples and those following HIm. This sermon covered many topics from how to treat one another to how to dedicate your life to God. Living free from hypocrisy but full of love, grace, wisdom and discernment",
   "Biblical References": "Matthew 5:1-7:28",
   "Got Questions": "https://www.gotquestions.org/sermon-on-the-mount.html",
   "Notes": "",
   "Description Word Count": 48,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=-3nN9-C1yKU",
   "The Chosen": "https://watch.angelstudios.com/thechosen/watch?vid=S2:E8"
 },
 {
   "Sequence": 13,
   "Title": "Jesus Calls Levi AKA Matthew",
   "Place": "Capernaum",
   "Longitude": 35.575,
   "Latitude": 32.8811,
   "Date": "",
   "Jesus' Age": 31,
   "Description": "Throughout Jesus' mininistry people would follow him and hear him speak. However, Jesus explictly called for Matthew to follow Him. Even though Matthew was despised among Jews for betraying them by working for the Romans, collecting taxes. People questioned Jesus for hanging out with people like Matthew but Jesus said He came for the sinners, not for people who think they are right with God. As Jesus said it's impossible to save a person who doesn't believe they need to be saved.",
   "Biblical References": "Matthew 5:3; Matthew 9:9-13; Matthew 11:28",
   "Got Questions": "https://www.gotquestions.org/Matthew-in-the-Bible.html",
   "Notes": "",
   "Description Word Count": 82,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/results?search_query=jesus+call+matthew",
   "The Chosen": ""
 },
 {
   "Sequence": 14,
   "Title": "Jesus' sermon from the boat",
   "Place": "Capernaum, sea of Galilee",
   "Longitude": 35.575,
   "Latitude": 32.8811,
   "Date": "",
   "Jesus' Age": 31,
   "Description": "After a tiring day Jesus said to His disciples let's cross to the other said so in that and other boats to went out to sea. This sea is prone to storms because of the Mediterranean winds and the semi-tropical conditions on this sea below sea level with tall hills and mountains around it. So a storm came upon the disciples while Jesus was sound asleep. However, the boats started to fill up. The disciples were filled with fear questioning Jesus if he even cares about them as they believe they were able to die! Jesus woke up and commanded for the wind and sea, \"Peace! Be still!\" Everything was suddently calm, both wind and waves. Jesus then asked where was their faith. However, the disciples were confused but afraid of Jesus' powers since even the wind and the sea obey Him.",
   "Biblical References": "Mark 4:35-41",
   "Got Questions": "https://www.gotquestions.org/Sea-of-Galilee.html",
   "Notes": "",
   "Description Word Count": 142,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=hj0cVBYKaEg",
   "The Chosen": ""
 },
 {
   "Sequence": 15,
   "Title": "Jesus heals Jairus' Daughter",
   "Place": "Capernaum",
   "Longitude": 35.575,
   "Latitude": 32.8811,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "Healings were one of the many things Jesus did on earth. So once the disciples and Jesus cross the sea of Galilee He was met with another crowd. Then one of the rulers of the synagogue in Capernuam arrived to the crowd he went down to Jesus' feet, humbling himself before Jesus. Jairus pleads that Jesus heals his dying daughter. In faith he asks Jesus to place his hand on her so that she will live. Jesus agreed to this. On His way to the daughte Jairus wasn't the only one with great faith. A women who tried everything to stop her constant bleeding saw Jesus and knew if she could just touch His robe she would be healed. She touch Jesus' robe, Jesus felt healing power went out of Him and looked until he saw this trembling but faithful woman who was now healed. During that time messengers told Jairus that his daughter is dead. Jesus went anyways bringing the first four disciples with Him. Jesus then held the girl's hand and told her to get up and she did! Jesus then told them to not tell anyone of what happened and to give the girl something to eat.",
   "Biblical References": "Mark 5:21-43",
   "Got Questions": "https://www.gotquestions.org/talitha-cumi.html",
   "Notes": "",
   "Description Word Count": 200,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=MGJ0TKRTEFI",
   "The Chosen": ""
 },
 {
   "Sequence": 16,
   "Title": "Feeding of the 5000 (Fish and Loaves)",
   "Place": "Bethsaida",
   "Longitude": 35.6306,
   "Latitude": 32.91,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "Jesus was once again teaching on the North East side of the Sea of Galilee by Bethsaida. He was followed everywhere because the miracles He did. It was getting close to Passover again",
   "Biblical References": "Mark 6:35-44; \nJohn 6:6-14",
   "Got Questions": "https://www.gotquestions.org/feeding-the-5000.html",
   "Notes": "",
   "Description Word Count": 33,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=yOL9JZXd1M4",
   "The Chosen": ""
 },
 {
   "Sequence": 17,
   "Title": "Jesus Walks on Water",
   "Place": "Sea of Galilee, Gennesaret",
   "Longitude": 35.5072,
   "Latitude": 32.8606,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "",
   "Biblical References": "",
   "Got Questions": "https://www.gotquestions.org/walking-on-water.html",
   "Notes": "",
   "Description Word Count": null,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=SIW6HVl4qSE",
   "The Chosen": ""
 },
 {
   "Sequence": 18,
   "Title": "Feeding of the 4000",
   "Place": "Decapolis, Dalmanutha, Bethsaida",
   "Longitude": 35.6306,
   "Latitude": 32.91,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "This is the second time Jesus feeds a crowd that came to listen to him. This time we are told that there were about 4,000 people there and like the first time, Jesus uses the 7 loaves of  bread and some fish that disciples had to feed all these people. Here again people there was seven large baskets of leftover bread after the crowd was fed. ",
   "Biblical References": "Mark 8:1-9 ",
   "Got Questions": "https://www.gotquestions.org/feeding-the-hungry.html",
   "Notes": "",
   "Description Word Count": 66,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=bMSUByyJpcA",
   "The Chosen": ""
 },
 {
   "Sequence": 19,
   "Title": "Jesus fortells his death for the first time",
   "Place": "Caesarea Philippi",
   "Longitude": 35.6933,
   "Latitude": 33.2461,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "Jesus starts to reshape the disciple's expectation of Jesus' mission as a Messiah. He tells them for the first time that he is about to suffer and die by the hands of the religious leaders of Isreal. He also foretells that He will raise again after 3 days. ",
   "Biblical References": "",
   "Got Questions": "https://www.gotquestions.org/I-go-to-prepare-a-place-for-you.html",
   "Notes": "",
   "Description Word Count": 48,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=Hy20IoNoit4",
   "The Chosen": ""
 },
 {
   "Sequence": 20,
   "Title": "The Transfiguration",
   "Place": "Mt. Hermon",
   "Longitude": 35.8575,
   "Latitude": 33.4161,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "Jesus is fully man and fully God. Peter, James and John got to see a glimspe of this when Jesus took them up on a mountain and transfigured before them. His face began to shine and his clothes became brilliantly white. Paul, who later became a follower of Jesus and wrote many books of the New Testament,  writes in one of his letters \" Though he[Jesus] was by nature God, he did not consider equality with God as a prize to be displayed, but he emptied himself by taking the nature of a servant. When he was born in human likeness, and his appearance was like that of any other man\". (Philippians 2:5-7)",
   "Biblical References": "Matthew 17:1-13",
   "Got Questions": "https://www.gotquestions.org/transfiguration.html",
   "Notes": "",
   "Description Word Count": 113,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=Pl-6pTDa1yU",
   "The Chosen": ""
 },
 {
   "Sequence": 21,
   "Title": "Jesus Foretells His Death for the second time",
   "Place": "Galilee, Capernaum",
   "Longitude": 35.575,
   "Latitude": 32.8811,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "In God's upside kingdom to be \"first\", you need to be last, that means you need to be humble like a servant. Jesus reminds his disciples that he is going to exemplify this by predicting, again, that he will be killed and will rise again after three days. ",
   "Biblical References": "Mark 9: 30-37",
   "Got Questions": "https://www.gotquestions.org/Jesus-predict-His-death.html",
   "Notes": "",
   "Description Word Count": 48,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=M_vVCibGHl4",
   "The Chosen": ""
 },
 {
   "Sequence": 22,
   "Title": "Jesus teaches his disciples how to pray",
   "Place": "Perea",
   "Longitude": 35.2644,
   "Latitude": 31.77,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "Prayer is how we talk to God. It does not have to be long and we don't need to use any fancy words or mantras. Jesus helps his disciples break away from their notions of prayer and gives a simple prayers that we can use when we want to talk to God.  ",
   "Biblical References": "Mathew 6:5-14",
   "Got Questions": "https://www.gotquestions.org/our-Father-which-art-in-heaven.html",
   "Notes": "",
   "Description Word Count": 52,
   "Indigitube": {"movie_name": "The Savior – 6. The Lord’s Prayer – Pashto Language Film","movie_link": "https://www.thesavior.info/ps/the-savior/the-lords-prayer/"},
   "Bible Project": "https://www.youtube.com/watch?v=qNTBQ-hHrYU",
   "The Chosen": "https://watch.angelstudios.com/thechosen/watch?vid=S2:E8"
 },
 {
   "Sequence": 23,
   "Title": "Lazarus raised from the dead",
   "Place": "Perea, Bethany",
   "Longitude": 35.2644,
   "Latitude": 31.77,
   "Date": "",
   "Jesus' Age": 32,
   "Description": "Jesus knew that his friend, Lazarus was sick but He only arrived in town four days after Lazarus died. Jesus wept along with Lazarus' family even though he knew that this was not the end of Lazarus's story. ",
   "Biblical References": "John 11:38-44",
   "Got Questions": "https://www.gotquestions.org/what-happened-to-Lazarus.html",
   "Notes": "",
   "Description Word Count": 38,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=qZbP38Jxzn8",
   "The Chosen": ""
 },
 {
   "Sequence": 24,
   "Title": "The Last Supper",
   "Place": "Upper Room",
   "Longitude": 35.2293,
   "Latitude": 31.772,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "The Passover festival was an important jewish festival that celebrated the exodus of Isreal from salvery in Egypt. Jesus uses the passover to instiute a new convenat relationship with God, where Jesus' scarifce on our behalf allows us to be freed from the salvery of sin and death. ",
   "Biblical References": "Luke 22:17-20",
   "Got Questions": "https://www.gotquestions.org/Last-Supper.html",
   "Notes": "",
   "Description Word Count": 48,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=vBOR4XMDFZw",
   "The Chosen": ""
 },
 {
   "Sequence": 25,
   "Title": "Jesus' prayer in the garden of Gethsemane",
   "Place": "Garden of Gethsemane",
   "Longitude": 35.2402,
   "Latitude": 31.7794,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Jesus knew that the time of his curfixion was near. So he took his disciples to the garden of Gethsemane to pray. We see Jesus wrestling with consquence of bearing the sin of the world. Ultimately, He asks God for his will to be done. It is good to know that Jesus can relate to our own struggles when we find it hard to do God's will in our lives. ",
   "Biblical References": "Matthew 26:36-46",
   "Got Questions": "https://www.gotquestions.org/garden-of-Gethsemane.html",
   "Notes": "",
   "Description Word Count": 70,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=goR5FO1vge8",
   "The Chosen": ""
 },
 {
   "Sequence": 26,
   "Title": "Judas Iscariot Betrays Jesus",
   "Place": "Garden of Gethsemane",
   "Longitude": 35.2402,
   "Latitude": 31.7794,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Judas Iscariot, one of Jesus' disciples, decides to work with the regilious leaders from some money to hand over Jesus. Judas meets Jesus in the garden with some temple guards and uses a kiss as a sign to identify Jesus for the guards. Jesus knew all along that Judas was going to betary him and went with the gaurds,  even though Jesus' disciplies tried to restort to violence to try to stop them. ",
   "Biblical References": "Matthew 26: 47-56",
   "Got Questions": "https://www.gotquestions.org/Judas-betray-Jesus.html",
   "Notes": "",
   "Description Word Count": 73,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=sz7UICFortc",
   "The Chosen": ""
 },
 {
   "Sequence": 27,
   "Title": "Jesus on Trial with the high priest",
   "Place": "The Courtyard of Caiaphas, the High Priest",
   "Longitude": 35.2288,
   "Latitude": 31.7725,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Jesus is brought before the jewish leaders and they try their best to accuse Jesus of saying something wrong. Jesus openly admits that he is the Messiah by quoteing a prophecy in the book Daniel 7:13. This was enough for the leaders to sentence him to death but they needed Roman authority to do so. ",
   "Biblical References": "Matthew 26: 57-67",
   "Got Questions": "https://www.gotquestions.org/trials-of-Jesus.html",
   "Notes": "",
   "Description Word Count": 55,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=zMaHYMs6NB4",
   "The Chosen": ""
 },
 {
   "Sequence": 28,
   "Title": "Pontius Pilate Hands Over Jesus",
   "Place": "Roman Governor's Palace",
   "Longitude": 35.2281,
   "Latitude": 31.7746,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Pontius Pilate was the governor of Judea from 26 -36 AD. Jesus was brought to Pilate to be tried and put to death. Even though Pilate did not find Jesus guilty of the accusations brought against him, Pilate caved into the religious leader's demand to crucify Jesus. ",
   "Biblical References": "Mark 15: 1-15",
   "Got Questions": "https://www.gotquestions.org/Pontius-Pilate.html",
   "Notes": "",
   "Description Word Count": 47,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=rs-nHYYmors",
   "The Chosen": ""
 },
 {
   "Sequence": 29,
   "Title": "Jesus crucified",
   "Place": "Golgotha",
   "Longitude": 35.2294,
   "Latitude": 31.7786,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "If you've ever seen a cross, this is where it originated! Crosses were used in Roman times as a way to execute criminals, even before Jesus. But Jesus' death on this cross became a turning point in history, and the cross became a symbol of the ultimate sacrifice, dying for others, so that they might live. ",
   "Biblical References": "Mark 15: 21-39",
   "Got Questions": "https://www.gotquestions.org/why-was-Jesus-crucified.html",
   "Notes": "",
   "Description Word Count": 56,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=_unHmAf7INk&list=PLH0Szn1yYNec6O3ZOZzAMb2WW2abJwzZ-&index=4",
   "The Chosen": ""
 },
 {
   "Sequence": 30,
   "Title": "Jesus buried at the tomb of Joseph",
   "Place": "The Tomb",
   "Longitude": 35.2297,
   "Latitude": 31.7783,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Joseph of Arimathea asked Pilate if he could take down Jesus' body before the sabbath to bury him. Aftter getting permission Jesus was laid in a tomb that was cut out a rock and ",
   "Biblical References": "John 19:31-42",
   "Got Questions": "https://www.gotquestions.org/Jesus-family-tomb.html",
   "Notes": "",
   "Description Word Count": 34,
   "Indigitube": {"movie_name": "The Savior – 7. Golgotha – Pashto Language Film", "movie_link": "https://www.thesavior.info/ps/the-savior/golgotha"},
   "Bible Project": "https://www.youtube.com/watch?v=5CVx4Tif7Ws",
   "The Chosen": ""
 },
 {
   "Sequence": 31,
   "Title": "Jesus appears to Mary",
   "Place": "Outside the Tomb",
   "Longitude": 35.2297,
   "Latitude": 31.7783,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Early Sunday morning, a woman named Mary Magdalene went to Jesus' tomb to care for his body. But when she got there, the tomb was empty and Jesus' body was gone! She was dumbfounded, and unsure what to do. She wandered through the garden cemetery wandering what to do next, feeling confused. Then a man who she thought was the gardener came up to her. But he knew her name. \"Mary,\" he said. And instantly, she knew it was Jesus. Somehow! Not that she was any less confused, but somehow, the impossible was true. Jesus has come back from the dead! Jesus then told Mary to go tell his disciples. So she left the garden, and began spreading the news.",
   "Biblical References": "Mark 16:2-14",
   "Got Questions": "https://www.gotquestions.org/where-was-Jesus.html",
   "Notes": "",
   "Description Word Count": 120,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=Vb24Lk1Oh5M&list=PLH0Szn1yYNec6O3ZOZzAMb2WW2abJwzZ-&index=5",
   "The Chosen": "https://www.youtube.com/watch?v=MlKetn7ZiNU"
 },
 {
   "Sequence": 32,
   "Title": "Jesus appears on the road to Emmaus",
   "Place": "Road to Emmaus",
   "Longitude": 34.9894,
   "Latitude": 31.8394,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "The news of Jesus' resurrection was slowly beginning to spread. After all, how could you keep something like that quiet? On Sunday night, two of Jesus' followers were walking home from Jerusalem to a neighboring village, west of the city. They encountered a stranger on their route, and fell into conversation with him. He seemed not to know about the news, but he did seem to know about the prophecies of the Jewish scriptures. They invited him to their home for dinner that evening. When they sat down, he prayed over the food, and suddenly they realized who he was. They could hardly believe it. And then, just as suddenly, he disappeared! With hardly a moment to spare, they put their sandals back on and ran back to Jerusalem to tell the others!",
   "Biblical References": "Luke 24:13-35",
   "Got Questions": "https://www.gotquestions.org/road-to-Emmaus.html",
   "Notes": "",
   "Description Word Count": 133,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=8YlzWPPiH4A",
   "The Chosen": ""
 },
 {
   "Sequence": 33,
   "Title": "Jesus Appears on the Beach to the Disciples",
   "Place": "Sea of Galilee",
   "Longitude": 35.5833,
   "Latitude": 32.8333,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Jesus was still revealling Himself to others as the news of His resurection spread. So along the Sea of Galiee where Peter, Thomas, Nathanael and other disciples went back to their old life of fishing, discouraged and not sure what was next. So Jesus went up to them and asked how their fishing was going, and the the disciples said they have caught nothing. Also, they didn't know it was Jesus. So Jesus once again asked them to cast their fishing net to the right side of the boat just as Jesus asked when He first met Peter. The same thing happened, The disciples once again witnessed an overwhelming amount of fish that overloaded the boat. Peter knew it was Jesus and swam to shore. After that they ate breakfast.",
   "Biblical References": "John 21:1-15",
   "Got Questions": "https://www.gotquestions.org/resurrection-accounts.html",
   "Notes": "",
   "Description Word Count": 130,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=kP3753Pc8-w",
   "The Chosen": ""
 },
 {
   "Sequence": 34,
   "Title": "Ascension",
   "Place": "Mount of Olives",
   "Longitude": 35.2439,
   "Latitude": 31.7783,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "This is the great end to Jesus' physical presence on earth. The disciples stil don't fully understand what is next in their journey with Jesus and ask questions of when the Isreal will be restored it Isreal's former glory and sit on the throne to rule from Jersusalem. Jesus then responds that it's not for them to know but to instead trust God's plan. Jesus introduces the Holy Spirit and explains how they will be a witness of Jesus to all people groups and languages once you have the Holy Spirit. As soon as Jesus said that He was lifted up into a cloud where they could no longer see Jesus. As they gazed into the sky, two men in white robes as why they are looking up in the sky? They continue to state that the way Jesus went to Heaven is the same way He will return the same way. They were referring to the day of Judgement.",
   "Biblical References": "Acts 1:6-11",
   "Got Questions": "https://www.gotquestions.org/ascension-Jesus-Christ.html",
   "Notes": "",
   "Description Word Count": 160,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=RD0LNtc1UE4",
   "The Chosen": ""
 },
 {
   "Sequence": 35,
   "Title": "The Disciples Receiving the Holy Spirit",
   "Place": "Jerusalem",
   "Longitude": 35.2293,
   "Latitude": 31.772,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Even though Jesus was physically gone His presence in the form of the Holy Spirit has not yet come. On the day of Pentecost suddenly a rushing wind filled the home where the disciples where sitting and it seemed to have fire rest on each one of them. The Holy Spirit was now in the disciples and they were able to speak different languages. Since many devote Jews came to Jerusalem on the day of Pentacost many grew up speaking their mother tongue/language. They heard the disciples and heard these Galilean men speaking different langauges. Languages they understood! Some mocked them thinking they were drinking wine. However, Peter corrected them since it's only early in the morning. Why would they be drinking already? Peter continue to preach and be a witness to others that day.",
   "Biblical References": "Acts 2:1-41",
   "Got Questions": "https://www.gotquestions.org/Pentecost-Sunday.html",
   "Notes": "",
   "Description Word Count": null,
   "Indigitube": "",
   "Bible Project": "https://www.youtube.com/watch?v=JQhkWmFJKnA&list=PLH0Szn1yYNec6O3ZOZzAMb2WW2abJwzZ-&index=6",
   "The Chosen": ""
 },
 {
   "Sequence": 36,
   "Title": "Jesus appears to Paul",
   "Place": "Road to Damacus",
   "Longitude": 33.1476,
   "Latitude": 35.7578,
   "Date": "",
   "Jesus' Age": 33,
   "Description": "Jesus physical presence may have been gone and His Holy Spirit came upon the disciples but one more appreance or more of a blinding had to be done. Saul was a proud Jew who fought for the right thing and he was turning and killing in Christ followers, also known as who belong to The Way. So Saul with his men were on theres way to Damascus. Suddently a bright light from the sky and Heaven shined around Saul. However, the men with him hear a voice but could not see anyone. Then the voice of Jesus ask him, \"why are you persecuting me?\" referring to Jesus' disciples, the Body of Christ, the Church. After the voice and bright light was gone Saul was unable to see so his men led him to Damascus. He could not see for three days, he did not eat or drink. Saul regained his sight once he arrived in Damascus and the disciple named Anaias put his hand on Saul saying that Jesus sent him to so you can see again and be filled with the Holy Spirit. Saul was then baptized and ate food. Saul eventually was renamed to Paul.",
   "Biblical References": "Acts 9:1",
   "Got Questions": "https://www.gotquestions.org/Damascus-Road.html",
   "Notes": "",
   "Description Word Count": 197,
   "Indigitube": {"movie_name": "The Savior – 8. Jesus is Risen – Pashto Language Film", "movie_link": "https://www.thesavior.info/ps/the-savior/jesus-appears"},
   "Bible Project": "https://www.youtube.com/watch?v=oiVAbkINtRU&list=PLH0Szn1yYNec6O3ZOZzAMb2WW2abJwzZ-&index=7",
   "The Chosen": ""
 }
]
